Microchip-MPLAB-Harmony/touch_apps/apps/qt8_selfcap_surface_xpro_board/pic32cm_pl10_cnano/Firmware/src/packs/PIC32CM6408PL10048_DFP/component/nvmctrl.h
/*
 * Component description for NVMCTRL
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*      file generated from device description file (ATDF) version None       */
#ifndef _PIC32CMPL10_NVMCTRL_COMPONENT_H_
#define _PIC32CMPL10_NVMCTRL_COMPONENT_H_

#include "core_cm0plus.h"

/* ************************************************************************** */
/*                    SOFTWARE API DEFINITION FOR NVMCTRL                     */
/* ************************************************************************** */

/* -------- NVMCTRL_CTRLB : (NVMCTRL Offset: 0x04) (R/W 32) Control B -------- */
#define NVMCTRL_CTRLB_RESETVALUE              _UINT32_(0x00)                                       /*  (NVMCTRL_CTRLB) Control B  Reset Value */

#define NVMCTRL_CTRLB_CMD_Pos                 _UINT32_(0)                                          /* (NVMCTRL_CTRLB) Command Position */
#define NVMCTRL_CTRLB_CMD_Msk                 (_UINT32_(0x7F) << NVMCTRL_CTRLB_CMD_Pos)            /* (NVMCTRL_CTRLB) Command Mask */
#define NVMCTRL_CTRLB_CMD(value)              (NVMCTRL_CTRLB_CMD_Msk & (_UINT32_(value) << NVMCTRL_CTRLB_CMD_Pos)) /* Assignment of value for CMD in the NVMCTRL_CTRLB register */
#define   NVMCTRL_CTRLB_CMD_NOCMD_Val         _UINT32_(0x0)                                        /* (NVMCTRL_CTRLB) No command  */
#define   NVMCTRL_CTRLB_CMD_NOOP_Val          _UINT32_(0x1)                                        /* (NVMCTRL_CTRLB) No operation  */
#define   NVMCTRL_CTRLB_CMD_FLWR_Val          _UINT32_(0x2)                                        /* (NVMCTRL_CTRLB) Flash Write Enable  */
#define   NVMCTRL_CTRLB_CMD_FLPER_Val         _UINT32_(0x8)                                        /* (NVMCTRL_CTRLB) Flash Page Erase Enable  */
#define   NVMCTRL_CTRLB_CMD_FLMPER2_Val       _UINT32_(0x9)                                        /* (NVMCTRL_CTRLB) Flash 2-page Erase Enable  */
#define   NVMCTRL_CTRLB_CMD_FLMPER4_Val       _UINT32_(0xA)                                        /* (NVMCTRL_CTRLB) Flash 4-page Erase Enable  */
#define   NVMCTRL_CTRLB_CMD_FLMPER8_Val       _UINT32_(0xB)                                        /* (NVMCTRL_CTRLB) Flash 8-page Erase Enable  */
#define   NVMCTRL_CTRLB_CMD_FLMPER16_Val      _UINT32_(0xC)                                        /* (NVMCTRL_CTRLB) Flash 16-page Erase Enable  */
#define   NVMCTRL_CTRLB_CMD_FLMPER32_Val      _UINT32_(0xD)                                        /* (NVMCTRL_CTRLB) Flash 32-page Erase Enable  */
#define   NVMCTRL_CTRLB_CMD_LR_Val            _UINT32_(0xE)                                        /* (NVMCTRL_CTRLB) Lock Region. Sets the bit in the Region n Lock Bits bit field in the Lock Section register (NVMCTRL.LOCK) corresponding to the address location in the ADDR register.  */
#define   NVMCTRL_CTRLB_CMD_UR_Val            _UINT32_(0xF)                                        /* (NVMCTRL_CTRLB) Unlock Region. Clears the bit in NVMCTRL.LOCK corresponding to the address location in the ADDR register.  */
#define   NVMCTRL_CTRLB_CMD_EBOOTCFG_Val      _UINT32_(0x10)                                       /* (NVMCTRL_CTRLB) Erase BOOTCFG Page Enable  */
#define   NVMCTRL_CTRLB_CMD_WBOOTCFG_Val      _UINT32_(0x11)                                       /* (NVMCTRL_CTRLB) Write BOOTCFG Page Enable  */
#define   NVMCTRL_CTRLB_CMD_WLOCKREGION_Val   _UINT32_(0x12)                                       /* (NVMCTRL_CTRLB) Write Enable to ROMCFG.NVMLOCKREGION. Writes to other addresses will cause STATUS.PROGE to be set.  */
#define   NVMCTRL_CTRLB_CMD_WROMCFG_Val       _UINT32_(0x20)                                       /* (NVMCTRL_CTRLB) Write ROMCFG Page Enable. The ROMCFG Page is used by the boot ROM to store Debug Access Level (DAL) bits and other security or protection bits for such as CEHL and Immutable boot.  */
#define   NVMCTRL_CTRLB_CMD_CHER_Val          _UINT32_(0x21)                                       /* (NVMCTRL_CTRLB) Erase FlashRequires DAL == 2 or SYSINT privileges  */
#define NVMCTRL_CTRLB_CMD_NOCMD               (NVMCTRL_CTRLB_CMD_NOCMD_Val << NVMCTRL_CTRLB_CMD_Pos) /* (NVMCTRL_CTRLB) No command Position */
#define NVMCTRL_CTRLB_CMD_NOOP                (NVMCTRL_CTRLB_CMD_NOOP_Val << NVMCTRL_CTRLB_CMD_Pos) /* (NVMCTRL_CTRLB) No operation Position */
#define NVMCTRL_CTRLB_CMD_FLWR                (NVMCTRL_CTRLB_CMD_FLWR_Val << NVMCTRL_CTRLB_CMD_Pos) /* (NVMCTRL_CTRLB) Flash Write Enable Position */
#define NVMCTRL_CTRLB_CMD_FLPER               (NVMCTRL_CTRLB_CMD_FLPER_Val << NVMCTRL_CTRLB_CMD_Pos) /* (NVMCTRL_CTRLB) Flash Page Erase Enable Position */
#define NVMCTRL_CTRLB_CMD_FLMPER2             (NVMCTRL_CTRLB_CMD_FLMPER2_Val << NVMCTRL_CTRLB_CMD_Pos) /* (NVMCTRL_CTRLB) Flash 2-page Erase Enable Position */
#define NVMCTRL_CTRLB_CMD_FLMPER4             (NVMCTRL_CTRLB_CMD_FLMPER4_Val << NVMCTRL_CTRLB_CMD_Pos) /* (NVMCTRL_CTRLB) Flash 4-page Erase Enable Position */
#define NVMCTRL_CTRLB_CMD_FLMPER8             (NVMCTRL_CTRLB_CMD_FLMPER8_Val << NVMCTRL_CTRLB_CMD_Pos) /* (NVMCTRL_CTRLB) Flash 8-page Erase Enable Position */
#define NVMCTRL_CTRLB_CMD_FLMPER16            (NVMCTRL_CTRLB_CMD_FLMPER16_Val << NVMCTRL_CTRLB_CMD_Pos) /* (NVMCTRL_CTRLB) Flash 16-page Erase Enable Position */
#define NVMCTRL_CTRLB_CMD_FLMPER32            (NVMCTRL_CTRLB_CMD_FLMPER32_Val << NVMCTRL_CTRLB_CMD_Pos) /* (NVMCTRL_CTRLB) Flash 32-page Erase Enable Position */
#define NVMCTRL_CTRLB_CMD_LR                  (NVMCTRL_CTRLB_CMD_LR_Val << NVMCTRL_CTRLB_CMD_Pos)  /* (NVMCTRL_CTRLB) Lock Region. Sets the bit in the Region n Lock Bits bit field in the Lock Section register (NVMCTRL.LOCK) corresponding to the address location in the ADDR register. Position */
#define NVMCTRL_CTRLB_CMD_UR                  (NVMCTRL_CTRLB_CMD_UR_Val << NVMCTRL_CTRLB_CMD_Pos)  /* (NVMCTRL_CTRLB) Unlock Region. Clears the bit in NVMCTRL.LOCK corresponding to the address location in the ADDR register. Position */
#define NVMCTRL_CTRLB_CMD_EBOOTCFG            (NVMCTRL_CTRLB_CMD_EBOOTCFG_Val << NVMCTRL_CTRLB_CMD_Pos) /* (NVMCTRL_CTRLB) Erase BOOTCFG Page Enable Position */
#define NVMCTRL_CTRLB_CMD_WBOOTCFG            (NVMCTRL_CTRLB_CMD_WBOOTCFG_Val << NVMCTRL_CTRLB_CMD_Pos) /* (NVMCTRL_CTRLB) Write BOOTCFG Page Enable Position */
#define NVMCTRL_CTRLB_CMD_WLOCKREGION         (NVMCTRL_CTRLB_CMD_WLOCKREGION_Val << NVMCTRL_CTRLB_CMD_Pos) /* (NVMCTRL_CTRLB) Write Enable to ROMCFG.NVMLOCKREGION. Writes to other addresses will cause STATUS.PROGE to be set. Position */
#define NVMCTRL_CTRLB_CMD_WROMCFG             (NVMCTRL_CTRLB_CMD_WROMCFG_Val << NVMCTRL_CTRLB_CMD_Pos) /* (NVMCTRL_CTRLB) Write ROMCFG Page Enable. The ROMCFG Page is used by the boot ROM to store Debug Access Level (DAL) bits and other security or protection bits for such as CEHL and Immutable boot. Position */
#define NVMCTRL_CTRLB_CMD_CHER                (NVMCTRL_CTRLB_CMD_CHER_Val << NVMCTRL_CTRLB_CMD_Pos) /* (NVMCTRL_CTRLB) Erase FlashRequires DAL == 2 or SYSINT privileges Position */
#define NVMCTRL_CTRLB_CMDEX_Pos               _UINT32_(8)                                          /* (NVMCTRL_CTRLB) Command Execution Position */
#define NVMCTRL_CTRLB_CMDEX_Msk               (_UINT32_(0xFF) << NVMCTRL_CTRLB_CMDEX_Pos)          /* (NVMCTRL_CTRLB) Command Execution Mask */
#define NVMCTRL_CTRLB_CMDEX(value)            (NVMCTRL_CTRLB_CMDEX_Msk & (_UINT32_(value) << NVMCTRL_CTRLB_CMDEX_Pos)) /* Assignment of value for CMDEX in the NVMCTRL_CTRLB register */
#define   NVMCTRL_CTRLB_CMDEX_KEY_Val         _UINT32_(0xA5)                                       /* (NVMCTRL_CTRLB) Execution key  */
#define NVMCTRL_CTRLB_CMDEX_KEY               (NVMCTRL_CTRLB_CMDEX_KEY_Val << NVMCTRL_CTRLB_CMDEX_Pos) /* (NVMCTRL_CTRLB) Execution key Position */
#define NVMCTRL_CTRLB_Msk                     _UINT32_(0x0000FF7F)                                 /* (NVMCTRL_CTRLB) Register Mask  */


