Microchip-MPLAB-Harmony/touch_apps/apps/qt8_selfcap_surface_xpro_board/pic32cm_pl10_cnano/Firmware/src/packs/PIC32CM6408PL10048_DFP/component/nvmctrl.h
#define NVMCTRL_INTENCLR_READY_Pos            _UINT32_(0)                                          /* (NVMCTRL_INTENCLR) NVM Ready Interrupt Enable Position */
#define NVMCTRL_INTENCLR_READY_Msk            (_UINT32_(0x1) << NVMCTRL_INTENCLR_READY_Pos)        /* (NVMCTRL_INTENCLR) NVM Ready Interrupt Enable Mask */
#define NVMCTRL_INTENCLR_READY(value)         (NVMCTRL_INTENCLR_READY_Msk & (_UINT32_(value) << NVMCTRL_INTENCLR_READY_Pos)) /* Assignment of value for READY in the NVMCTRL_INTENCLR register */
#define NVMCTRL_INTENCLR_ERROR_Pos            _UINT32_(1)                                          /* (NVMCTRL_INTENCLR) Error Interrupt Enable Position */
#define NVMCTRL_INTENCLR_ERROR_Msk            (_UINT32_(0x1) << NVMCTRL_INTENCLR_ERROR_Pos)        /* (NVMCTRL_INTENCLR) Error Interrupt Enable Mask */
#define NVMCTRL_INTENCLR_ERROR(value)         (NVMCTRL_INTENCLR_ERROR_Msk & (_UINT32_(value) << NVMCTRL_INTENCLR_ERROR_Pos)) /* Assignment of value for ERROR in the NVMCTRL_INTENCLR register */
#define NVMCTRL_INTENCLR_Msk                  _UINT32_(0x00000003)                                 /* (NVMCTRL_INTENCLR) Register Mask  */


/* -------- NVMCTRL_INTENSET : (NVMCTRL Offset: 0x10) (R/W 32) Interrupt Enable Set -------- */
#define NVMCTRL_INTENSET_RESETVALUE           _UINT32_(0x00)                                       /*  (NVMCTRL_INTENSET) Interrupt Enable Set  Reset Value */

#define NVMCTRL_INTENSET_READY_Pos            _UINT32_(0)                                          /* (NVMCTRL_INTENSET) NVM Ready Interrupt Enable Position */
#define NVMCTRL_INTENSET_READY_Msk            (_UINT32_(0x1) << NVMCTRL_INTENSET_READY_Pos)        /* (NVMCTRL_INTENSET) NVM Ready Interrupt Enable Mask */
#define NVMCTRL_INTENSET_READY(value)         (NVMCTRL_INTENSET_READY_Msk & (_UINT32_(value) << NVMCTRL_INTENSET_READY_Pos)) /* Assignment of value for READY in the NVMCTRL_INTENSET register */
#define NVMCTRL_INTENSET_ERROR_Pos            _UINT32_(1)                                          /* (NVMCTRL_INTENSET) Error Interrupt Enable Position */
#define NVMCTRL_INTENSET_ERROR_Msk            (_UINT32_(0x1) << NVMCTRL_INTENSET_ERROR_Pos)        /* (NVMCTRL_INTENSET) Error Interrupt Enable Mask */
#define NVMCTRL_INTENSET_ERROR(value)         (NVMCTRL_INTENSET_ERROR_Msk & (_UINT32_(value) << NVMCTRL_INTENSET_ERROR_Pos)) /* Assignment of value for ERROR in the NVMCTRL_INTENSET register */
#define NVMCTRL_INTENSET_Msk                  _UINT32_(0x00000003)                                 /* (NVMCTRL_INTENSET) Register Mask  */


/* -------- NVMCTRL_INTFLAG : (NVMCTRL Offset: 0x14) (R/W 32) Interrupt Flag Status and Clear -------- */
#define NVMCTRL_INTFLAG_RESETVALUE            _UINT32_(0x00)                                       /*  (NVMCTRL_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define NVMCTRL_INTFLAG_READY_Pos             _UINT32_(0)                                          /* (NVMCTRL_INTFLAG) NVM Ready Position */
#define NVMCTRL_INTFLAG_READY_Msk             (_UINT32_(0x1) << NVMCTRL_INTFLAG_READY_Pos)         /* (NVMCTRL_INTFLAG) NVM Ready Mask */
#define NVMCTRL_INTFLAG_READY(value)          (NVMCTRL_INTFLAG_READY_Msk & (_UINT32_(value) << NVMCTRL_INTFLAG_READY_Pos)) /* Assignment of value for READY in the NVMCTRL_INTFLAG register */
#define NVMCTRL_INTFLAG_ERROR_Pos             _UINT32_(1)                                          /* (NVMCTRL_INTFLAG) Error Position */
#define NVMCTRL_INTFLAG_ERROR_Msk             (_UINT32_(0x1) << NVMCTRL_INTFLAG_ERROR_Pos)         /* (NVMCTRL_INTFLAG) Error Mask */
#define NVMCTRL_INTFLAG_ERROR(value)          (NVMCTRL_INTFLAG_ERROR_Msk & (_UINT32_(value) << NVMCTRL_INTFLAG_ERROR_Pos)) /* Assignment of value for ERROR in the NVMCTRL_INTFLAG register */
#define NVMCTRL_INTFLAG_Msk                   _UINT32_(0x00000003)                                 /* (NVMCTRL_INTFLAG) Register Mask  */


/* -------- NVMCTRL_INTFLAGSET : (NVMCTRL Offset: 0x18) (R/W 32) Interrupt Flag Software Set -------- */
#define NVMCTRL_INTFLAGSET_RESETVALUE         _UINT32_(0x00)                                       /*  (NVMCTRL_INTFLAGSET) Interrupt Flag Software Set  Reset Value */

#define NVMCTRL_INTFLAGSET_READY_Pos          _UINT32_(0)                                          /* (NVMCTRL_INTFLAGSET) NVM Ready Position */
#define NVMCTRL_INTFLAGSET_READY_Msk          (_UINT32_(0x1) << NVMCTRL_INTFLAGSET_READY_Pos)      /* (NVMCTRL_INTFLAGSET) NVM Ready Mask */
#define NVMCTRL_INTFLAGSET_READY(value)       (NVMCTRL_INTFLAGSET_READY_Msk & (_UINT32_(value) << NVMCTRL_INTFLAGSET_READY_Pos)) /* Assignment of value for READY in the NVMCTRL_INTFLAGSET register */
#define NVMCTRL_INTFLAGSET_ERROR_Pos          _UINT32_(1)                                          /* (NVMCTRL_INTFLAGSET) Error Position */
#define NVMCTRL_INTFLAGSET_ERROR_Msk          (_UINT32_(0x1) << NVMCTRL_INTFLAGSET_ERROR_Pos)      /* (NVMCTRL_INTFLAGSET) Error Mask */
#define NVMCTRL_INTFLAGSET_ERROR(value)       (NVMCTRL_INTFLAGSET_ERROR_Msk & (_UINT32_(value) << NVMCTRL_INTFLAGSET_ERROR_Pos)) /* Assignment of value for ERROR in the NVMCTRL_INTFLAGSET register */
#define NVMCTRL_INTFLAGSET_Msk                _UINT32_(0x00000003)                                 /* (NVMCTRL_INTFLAGSET) Register Mask  */


/* -------- NVMCTRL_STATUS : (NVMCTRL Offset: 0x1C) (R/W 32) Status -------- */
#define NVMCTRL_STATUS_RESETVALUE             _UINT32_(0x00)                                       /*  (NVMCTRL_STATUS) Status  Reset Value */

#define NVMCTRL_STATUS_PROGE_Pos              _UINT32_(2)                                          /* (NVMCTRL_STATUS) Programming Error Status Position */
#define NVMCTRL_STATUS_PROGE_Msk              (_UINT32_(0x1) << NVMCTRL_STATUS_PROGE_Pos)          /* (NVMCTRL_STATUS) Programming Error Status Mask */
#define NVMCTRL_STATUS_PROGE(value)           (NVMCTRL_STATUS_PROGE_Msk & (_UINT32_(value) << NVMCTRL_STATUS_PROGE_Pos)) /* Assignment of value for PROGE in the NVMCTRL_STATUS register */
#define NVMCTRL_STATUS_LOCKE_Pos              _UINT32_(3)                                          /* (NVMCTRL_STATUS) Lock Error Status Position */
#define NVMCTRL_STATUS_LOCKE_Msk              (_UINT32_(0x1) << NVMCTRL_STATUS_LOCKE_Pos)          /* (NVMCTRL_STATUS) Lock Error Status Mask */
#define NVMCTRL_STATUS_LOCKE(value)           (NVMCTRL_STATUS_LOCKE_Msk & (_UINT32_(value) << NVMCTRL_STATUS_LOCKE_Pos)) /* Assignment of value for LOCKE in the NVMCTRL_STATUS register */
#define NVMCTRL_STATUS_Msk                    _UINT32_(0x0000000C)                                 /* (NVMCTRL_STATUS) Register Mask  */


/* -------- NVMCTRL_ADDR : (NVMCTRL Offset: 0x20) (R/W 32) Address -------- */
#define NVMCTRL_ADDR_RESETVALUE               _UINT32_(0x00)                                       /*  (NVMCTRL_ADDR) Address  Reset Value */

#define NVMCTRL_ADDR_ADDR_Pos                 _UINT32_(0)                                          /* (NVMCTRL_ADDR) NVM Address Position */
#define NVMCTRL_ADDR_ADDR_Msk                 (_UINT32_(0xFFFFFFFF) << NVMCTRL_ADDR_ADDR_Pos)      /* (NVMCTRL_ADDR) NVM Address Mask */
#define NVMCTRL_ADDR_ADDR(value)              (NVMCTRL_ADDR_ADDR_Msk & (_UINT32_(value) << NVMCTRL_ADDR_ADDR_Pos)) /* Assignment of value for ADDR in the NVMCTRL_ADDR register */
#define NVMCTRL_ADDR_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (NVMCTRL_ADDR) Register Mask  */


